Feature: Запазване на час
    
   Scenario: Няма въведени данни
    Given Пациентът вижда полета за попълване
    When Пациентът натисне бутона за напред
    Then Пациентът вижда съобщение "Моля въведете данни!".
    
   Scenario: Няма въведено име на зъболекаря
    Given Пациентът вижда полета за попълване
    When Пациентът избира дата "12-02-2021"
    And пациентът натисне бутона за напред
    Then пациентът вижда съобщение "Моля въведете празните полета!".
 
  Scenario: Няма въведена дата
   Given Пациентът вижда полета за попълване
   When пациентът въвежда име на лекар "Иван"
   And пациентът въвежда фамилия на лекар "Иванов"
   And пациентът натисне бутона за напред
   Then пациентът вижда съобщение "Моля изберете дата!".
   
  Scenario: Няма въведена лична информация
   Given Пациентът вижда полета за попълване
   When пациентът въвежда име на лекар "Иван"
   And пациентът въвежда фамилия на лекар "Иванов"
   And пациентът избира дата "16-02-2020"
   And пациентът натисне бутона за напред
   Then пациентът вижда съобщение "Моля въведете лична информация".
   
  Scenario: Успешно запазване на час
   Given Пациентът вижда полета за попълване
   When пациентът въвежда име на лекар "Иван"
   And пациентът въвежда фамилия на лекар "Иванов"
   And пациентът избира дата "16-02-2020"
   And пациентът въвежда собствено име "Мария"
   And пациентът въвежда собствена фамилия "Петкова"
   And пациентът въвежда собствен телефонен номер "+359783091209"
   And пациентът натисне бутона за напред
   Then пациентът вижда съобщение "Успешно запазване на час!".
   
   
   


 