Feature: Търсене в сайта за зъболекари

Scenario: Търсене на зъболекар без въведена фамилия
Given пациента има полета за търсене.
When пациента въвежда име "Иван"
And пациента натисне бутона за търсене.
Then пациента вижда съобщение "Моля въведете фамилия!".

Scenario: Търсене на зъболекар без въведени данни
Given пациента има полета за търсене.
When пациента натисне бутона за търсене.
Then пациента вижда съобщение "Моля въведете данни за търсене!".

Scenario: Търсене на зъболекар с въведена специализация
Given пациента има полета за търсене.
When пациента въвежда специализация "Алерголог"
And пациента натисне бутона за търсене.
Then пациента вижда съобщение "Моля въведете име и фамилия!".

Scenario: Търсене на зъболекар с въведено име и фамилия
Given пациента има полета за търсене.
When пациента въвежда име "Иван"
And пациента въвежда  фамилия "Иванов"
And пациента натисне бутона за търсене.
Then пациента вижда съобщение "Моля въведете специализация!".

Scenario: Търсене на зъболекар с грешна специализация
Given пациента има полета за търсене.
When пациента въвежда специализация "Зъботехник"
And пациента въвежда име "Иван"
And пациента въвежда  фамилия "Иванов"
And пациента натисне бутона за търсене.
Then пациента вижда съобщение "Моля изчакайте!".